# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
backbone1depth: 4 # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone


backbone1:
  [[-1,1,Keep,[3]],
   [-1,1,dct_spose1,[128,80,80]],
   [0,1,dct_spose2,[256,40,40]],
   [0,1,dct_spose2,[512,20,20]],
  ]

backbone2:
  # [from, number, module, args]
  [[-1, 1, SpectConv, [64, 6, 2, 2]],  #4
   #320×320×32
   [-1, 1, Conv, [128, 3, 2]],  #5
   #160×160×64
   [-1, 3, C3, [128]],
   #160×160×64
   [-1, 1, SpectConv2, [256, 3, 2]],
   #80×80×128
   [-1, 3, C3, [256]],  # 8  num_block 6->3
   #80×80×128
   [[-1, 1], 1, Concat2, [1]],  #9    [[-1, 4], 1, Concat2, [1]]
   #80×80×256
   [-1, 3, C3, [256]],  #10  num_block 6->3
   #80×80×128
   [8, 1, SpectConv2, [512, 3, 2]],  #11
   #40×40×256
   [-1, 6, C3, [512]],     #num_block 9->6
   #40×40×256
   [[-1, 2], 1, Concat2, [1]],  # 13     [[-1, 6], 1, Concat2, [1]]
   #40×40×512
   [-1, 3, C3, [512]],  #14   num_block 6->3
   #40×40×256
   [11, 1, SpectConv2, [1024, 3, 2]],  #15
   #20×20×512
   [[-1, 3], 1, Concat2, [1]],  #16    [[-1, 9], 1, Concat2, [1]]
   #20×20×1024
   [-1, 3, C3, [1024]],
   #20×20×512
   [-1, 1, SPPF, [1024, 5]],  #18
   #20×20×512
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
  #20×20×256
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   #40×40×256
   [[-1, 14], 1, Concat, [1]],  # cat backbone P4
    #40×40×512
   [-1, 3, C3, [512, False]],  # 22
   #40×40×256

   [-1, 1, Conv, [256, 1, 1]],
   #40×40×128
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   #80×80×128
   [[-1, 10], 1, Concat, [1]],  # cat backbone P3
   #80×80×256
   [-1, 3, C3, [256, False]],  # 26 (P3/8-small)
   #80×80×128

   [-1, 1, Conv, [512, 3, 2]],
   #40×40×256
   [[-1, 22], 1, Concat, [1]],  #28 cat head P4
   #40×40×512
   [-1, 3, C3, [512, False]],  # 29 (P4/16-medium)
   #40×40×256

   [-1, 1, Conv, [1024, 3, 2]],
   #20×20×512
   [[-1, 18], 1, Concat, [1]],  # 31 cat head P5
   #20×20×1024
   [-1, 3, C3, [1024, False]],  # 32 (P5/32-large)
   #20×20×512

   [[26, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

 # [-1, 1, MobileNet1, [24]],  # 0
 #[-1, 1, MobileNet2, [48]],  # 1
#[-1, 1, MobileNet3, [576]],  # 2
# [-1, 1, SPPF, [1024, 5]],  # 3